# Terminal
cask "ghostty"

# Fonts
cask "font-hack-nerd-font"

# Shell Enhancements
brew "eza"        # ls replacement
brew "bat"        # cat replacement
brew "fzf"        # fuzzy finder
brew "ripgrep"    # grep replacement
brew "fd"         # find replacement
brew "zoxide"     # smart cd
brew "btop"       # system monitor
brew "htop"       # system monitor

# Dev Tools
brew "gh"         # GitHub CLI
brew "mise"       # runtime manager (node, python, etc.)
brew "git-flow"
brew "jq"
brew "vim"

# Network
brew "nmap"
